EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
//    All rights reserved.
//
//    Permission to use, copy, modify, and distribute this software and its
//    documentation for any purpose, without fee, and without written agreement is
//    hereby granted, provided that the above copyright notice, the following
//    two paragraphs and the authors appear in all copies of this software.
//
//    IN NO EVENT SHALL THE "AUTHORS" BE LIABLE TO ANY PARTY FOR
//    DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT
//    OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF THE "AUTHORS"
//    HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//    THE "AUTHORS" SPECIFICALLY DISCLAIMS ANY WARRANTIES,
//    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
//    AND FITNESS FOR A PARTICULAR PURPOSE.  THE SOFTWARE PROVIDED HEREUNDER IS
//    ON AN "AS IS" BASIS, AND THE "AUTHORS" HAS NO OBLIGATION TO
//    PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS."
//
//    Please maintain this header in its entirety when copying/modifying
//    these files.
//
// *********************************************
// Truck_App2.c
// *********************************************

/*
can't call ESOS_TASK_WAIT_TICKS from within mail recipient?

note: don't do any assignment statements before ESOS_TASK_BEGIN()
it causes strange side-effects
*/

#if 1
#if 1
#ifdef BUILT_ON_ESOS
#warning "BUILT_ON_ESOS defined"
#else
#warning "BUILT_ON_ESOS not defined"
#endif

#include "../esos/include/esos.h"
#include "../lib/include/pic24_ports_config.h"
#include "../lib/include/pic24_ports_mapping.h"
#include "../lib/include/pic24_libconfig.h"
#include "../esos/include/pic24/esos_pic24.h"
#include "../esos/include/pic24/esos_pic24_rs232.h"
#include "../esos/include/pic24/esos_pic24_spi.h"
#include "../lib/include/pic24_all.h"
#include "../lib/include/pic24_timer.h"
#include "../lib/include/pic24_util.h"
#include "../lib/include/pic24_adc.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "../../mytypes.h"

ESOS_SEMAPHORE(key_sem);
ESOS_SEMAPHORE(lcd_sem);
ESOS_USER_TASK(keypad);
ESOS_USER_TASK(poll_keypad);
//ESOS_USER_TASK(spi_task);
ESOS_USER_TASK(AVR_cmd);
ESOS_USER_TASK(main_proc);
ESOS_USER_TASK(send_fpga);
ESOS_USER_TASK(recv_lcd);
ESOS_USER_TASK(send_comm1);
ESOS_USER_TASK(recv_comm1);
ESOS_USER_TASK(menu_task);
ESOS_USER_TASK(password_task);
ESOS_USER_TASK(numentry_task);
ESOS_USER_TASK(display_menu);
ESOS_USER_TASK(display_rtlabels);
ESOS_USER_TASK(key_timer_task);
ESOS_USER_TASK(display_rtvalues);

static UCHAR avr_buffer[15];
static ESOS_TASK_HANDLE avr_handle;
static ESOS_TASK_HANDLE fpga_handle;

#define AVR_CALL() __esos_CB_WriteUINT8Buffer(avr_handle->pst_Mailbox->pst_CBuffer, &avr_buffer[0], 6);

#define MY_ESOS1

#define TDELAY 2
#define TDELAY2 1
#define VREF 3.3  //assume Vref = 3.3 volts
#define FLAG1	ESOS_USER_FLAG_1
#define PASSWORD_RETRIES_NUM 5

// offsets into eeprom
#define RT_VALUES_OFFSET 1
#define MENU_VALUES_OFFSET 36
#define VARIOUS_MSG_OFFSET 43

// start positions on screen
#define START_RT_VALUE_ROW 10
#define START_MENU_VALUE_ROW 1
#define START_RT_VALUE_COL 2
#define START_MENU_VALUE_COL 2

// handshaking lines to FPGA
#define DataReady _LATG14		// output
#define CmdParam _LATG12		// output
#define DataSent _RG13			// input

enum rt_values_offsets
{
	RPM,
	MPH,
	ENG_TEMP,
	OIL_PRES,
	AIR_TEMP,
	MAP,
	OIL_TEMP,
	O2,
	ODOM,
	TRIP
} RT_VALUES_OFFSETS_TYPES;

enum menu_values_offsets
{
	ENABLE_STARTER,
	IGNITION,
	FUEL_PUMP,
	COOLING_FAN,
	RUNNING_LIGHTS,
	HEADLIGHTS
} MENU_VALUES_OFFSETS_TYPES;

enum key_types
{
	KP_1 = 0xE0, // '1'		- E0
	KP_2, // '2'		- E1
	KP_3, // '3'		- E2
	KP_4, // '4'		- E3
	KP_5, // '5'		- E4
	KP_6, // '6'		- E5
	KP_7, // '7'		- E6
	KP_8, // '8'		- E7
	KP_9, // '9'		- E8
	KP_A, // 'A'		- E9
	KP_B, // 'B'		- EA
	KP_C, // 'C'		- EB
	KP_D, // 'D'		- EC
	KP_POUND,	// '#'	- ED
	KP_AST, // '*'		- EE
	KP_0 	// '0'		- EF
} KEY_TYPES;

typedef struct
{
	UCHAR row;
	UCHAR col;
	UCHAR data_col;
	UCHAR str;
	UCHAR onoff;
} FORMAT_STR;

#define NUM_MENU_LABELS 7
static FORMAT_STR menu_str[NUM_MENU_LABELS];

#define NUM_RT_LABELS 10
static FORMAT_STR rtlabel_str[NUM_RT_LABELS];

#define NUM_OUTPUT_LABELS 25
//static FORMAT_STR outputlabel_str[NUM_OUTPUT_LABELS+1];

volatile UCHAR menu_ptr;

#define ROWS 16
#define COLUMN 40
#define DISPLAY_OFF         0x90    //0b10010000, display off
#define CURSOR_ON_BLINK_OFF 0x92    //0b1001xx10, cursor on without blinking
#define CURSOR_BLINK_ON     0x93    //0b1001xx11, cursor on with blinking
#define TEXT_ON             0x94    //0b100101xx, text on, graphics off
#define GRAPHIC_ON          0x98    //0b100110xx, text off, graphics on
#define TEXT_GRH_ON         0x9C    //0b100111xx, text on, graphics on
#define ATTR_NORMAL         0x00    //Normal Display
#define ATTR_REVERSE        0x05    
//Reverse Di../t6963.h:189:33: error: expected ';', ',' or ')' before 'mode'splay
#define ATTR_INHIBIT        0x03    //Inhibit Display
#define ATTR_BLINK          0x08    //Blinking of Normal Display
#define ATTR_BLINK_REVERSE  0x0D    //Blinking of Reverse Display
#define ATTR_BLINK_INHIBIT  0x0B    //Blinking of Inhibit Display
#define LINE_8_CURSOR       0xA7    //8-line cursor mode
#define LINE_7_CURSOR       0xA6    //7-line cursor mode
#define LINE_6_CURSOR       0xA5    //6-line cursor mode
#define LINE_5_CURSOR       0xA4    //5-line cursor mode
#define LINE_4_CURSOR       0xA3    //4-line cursor mode
#define LINE_3_CURSOR       0xA2    //3-Line cursor mode
#define LINE_2_CURSOR       0xA1    //2-Line cursor mode
#define LINE_1_CURSOR       0xA0    //1-Line cursor mode

// commands for RPM LED display
#define RPM_OFF_CMD 				0x01
#define RPM_SEND_CHAR_CMD 			0x02
#define RPM_SET_BRIGHTNESS_CMD 		0x03
#define RPM_SET_CDECIMAL_CMD 		0x04
#define RPM_SET_UPDATE_RATE_CMD 	0x05
#define RPM_SET_FACTOR_CMD 			0x06

// commands for MPH LED display
#define MPH_OFF_CMD 				0x0A
#define MPH_SEND_CHAR_CMD 			0x0B
#define MPH_SET_BRIGHTNESS_CMD 		0x0C
#define MPH_SET_CDECIMAL_CMD 		0x0D
#define MPH_SET_UPDATE_RATE_CMD 	0x0E
#define MPH_SET_FACTOR_CMD 			0x0F

