EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
// other FPGA commands
#define SET_DISPLAY_UPDATE_RATE 	0x20
#define DTMF_TONE_ON 				0x21
#define DTMF_TONE_OFF 				0x22
#define SPECIAL_TONE_ON 			0x23
#define LCD_PWM 					0x24
#define FP_SHUTOFF_OVERRIDE 		0x25
#define SET_MAX_REV_LIMITER 		0x26
#define SET_MIN_REV_LIMITER 		0x27
#define TEST_RPM_LIMIT 				0x28


#define PWM_OFF_PARAM					0x01 // off
#define PWM_ON_PARAM					0x1F // on
#define PWM_80DC_PARAM					0x1A // duty_cycle = 80%
#define PWM_75DC_PARAM					0x16 // duty_cycle = 75%
#define PWM_60DC_PARAM					0x12 // duty_cycle = 60%
#define PWM_50DC_PARAM					0x0E // duty_cycle = square wave
#define PWM_30DC_PARAM					0x0A // duty_cycle = 30%
#define PWM_25DC_PARAM					0x06 // duty_cycle = 25%
#define PWM_12DC_PARAM					0x02 // duty_cycle = 12%

#define PASSWORD_SIZE 13

#define NUM_SIZE 200
static uint16_t au16_buffer[NUM_ADC_CHANNELS];
static UCHAR u8_pot[NUM_ADC_CHANNELS];
static UCHAR curr_num[NUM_SIZE];
static UCHAR curr_num_ptr;
uint8_t  u8_waiting;
int lat5;
static int key_enter_time;
static char password[PASSWORD_SIZE];
static char correct_password[PASSWORD_SIZE];
static UCHAR password_valid;
static int password_ptr;
static int password_retries;
static int dim_screen;
static int silent_key;
static UINT gl_rpm, gl_mph;
static UCHAR seconds_display_low;
static UCHAR seconds_display_high;
//static ESOS_TASK_HANDLE convADC_task_handle;

typedef enum
{
	NORMAL,
	PASSWORD,
	NUMENTRY,
}KEY_MODE;

KEY_MODE key_mode;

#endif
//******************************************************************************************//
//*************************************** menu_task ****************************************//
//******************************************************************************************//
ESOS_USER_TASK(menu_task)
{
	static UCHAR data1;
	static UINT data4;
    static ESOS_TASK_HANDLE menu_handle;
    static ESOS_TASK_HANDLE rt_handle;

	static int acc, fuel_pump, fan;
	static ESOS_TASK_HANDLE comm1_handle;
	static UCHAR test;
	
    ESOS_TASK_BEGIN();

	menu_handle = esos_GetTaskHandle(display_menu);
	rt_handle = esos_GetTaskHandle(display_rtlabels);

	comm1_handle = esos_GetTaskHandle(send_comm1);

	acc = fuel_pump = fan = 0;

	test= 0;
	while (TRUE)
	{
		ESOS_TASK_WAIT_FOR_MAIL();

		while(ESOS_TASK_IVE_GOT_MAIL())
		{
			data1 = __esos_CB_ReadUINT8(__pstSelf->pst_Mailbox->pst_CBuffer);
			switch(data1)
			{
				case 	KP_1:
				break;

				case 	KP_2:
					if(acc == 0)
					{
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ON_ACC);
						acc = 1;
					}
					else{
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_ACC);
						acc = 0;
					}
				break;

				case	KP_3:
					if(fuel_pump == 0)
					{
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ON_FUEL_PUMP);
						fuel_pump = 1;
					}
					else{
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_FUEL_PUMP);
						fuel_pump = 0;
					}
				break;

				case	KP_4:
					if(fan == 0)
					{
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ON_FAN);
						fan = 1;
					}
					else{
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_FAN);
						fan = 0;
					}
				break;

				case	KP_5:
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,START_SEQ);
				break;

				case	KP_6:
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,SHUTDOWN);
				break;

				case	KP_7:
				break;

				case	KP_8:
				break;

				case	KP_9:
				break;

				case	KP_A:		// move up in menu
					if(menu_ptr < 1)
						menu_ptr = NUM_MENU_LABELS;
					menu_ptr--;	

					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = menu_str[menu_ptr].row;
					avr_buffer[3] = menu_str[menu_ptr].col-2;
					avr_buffer[4] = (LINE_8_CURSOR);
					AVR_CALL();

				break;

				case	KP_B:		// move down in menu
/*
					avr_buffer[0] = SEND_INT_RT_VALUES;
					avr_buffer[1] = 0;
					avr_buffer[2] = 0;
					avr_buffer[3] = 1;
					avr_buffer[4] = 2;
					AVR_CALL();
*/

					if(++menu_ptr > NUM_MENU_LABELS - 1)
						menu_ptr = 0;

					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = menu_str[menu_ptr].row;
					avr_buffer[3] = menu_str[menu_ptr].col-2;
					avr_buffer[4] = (LINE_8_CURSOR);
					AVR_CALL();

				break;

				case	KP_C:
/*
					avr_buffer[0] = SEND_INT_RT_VALUES;
					avr_buffer[1] = 0;
					avr_buffer[2] = 0;
					avr_buffer[3] = 2;
					avr_buffer[4] = 3;
					AVR_CALL();
*/
//					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,
//						(menu_ptr+1)*2+menu_str[menu_ptr].onoff);
				break;

				case	KP_D:		// exec menu choice

					avr_buffer[0] = GOTO_CMD;
					avr_buffer[1] = menu_str[menu_ptr].row;
					avr_buffer[2] = menu_str[menu_ptr].col-2;
					AVR_CALL();

					if(menu_str[menu_ptr].onoff == 1)
						menu_str[menu_ptr].onoff = 0;
					else menu_str[menu_ptr].onoff = 1;
					avr_buffer[0] = CHAR_CMD;
					avr_buffer[1] = (menu_str[menu_ptr].onoff?'X':' ');
					AVR_CALL();

				break;

				case	KP_POUND:
					data4 = LCD_PWM;
					data4 <<= 8;
					data4 &= 0xFF00;
					data4 |= PWM_OFF_PARAM;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
					key_enter_time = 250;	// something > 240 so it won't come back on
											// unless key is pressed
					
				break;

				case	KP_AST:
					data4 = LCD_PWM;
					data4 <<= 8;
					data4 &= 0xFF00;
					data4 |= PWM_ON_PARAM;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
					key_enter_time = 0;

				break;

				case	KP_0:
					avr_buffer[0] = LCD_CLRSCR;
					avr_buffer[1] = 0;
					AVR_CALL();

					__esos_CB_WriteUINT8(menu_handle->pst_Mailbox->pst_CBuffer,data1);
					__esos_CB_WriteUINT8(rt_handle->pst_Mailbox->pst_CBuffer,data1);

				break;

				default:
				break;
			}
/*
			avr_buffer[0] = GOTO_CMD;
			avr_buffer[1] = 0;
			avr_buffer[2] = 0;
			AVR_CALL();

			avr_buffer[0] = CHAR_CMD;
			if(data1 >= KP_1 && data1 <= KP_9)
				avr_buffer[1] = data1 + 0x30-KP_1;
			else if(data1 >= KP_A && data1 <= KP_D)
				avr_buffer[1] = data1 + 0xE8-KP_A;
			else avr_buffer[1] = data1 + KP_1;	
			AVR_CALL();
*/
		}
	}
    ESOS_TASK_END();
}

//******************************************************************************************//
//************************************* password_task **************************************//
//******************************************************************************************//
ESOS_TASK_HANDLE password_task_handle;

ESOS_USER_TASK(password_task)
{
	static UCHAR data1, temp;
	static ESOS_TASK_HANDLE comm1_handle;
    static ESOS_TASK_HANDLE menu_handle;
    static ESOS_TASK_HANDLE rt_handle;

    ESOS_TASK_BEGIN();

