EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
    password_task_handle = ESOS_TASK_GET_TASK_HANDLE();
	comm1_handle = esos_GetTaskHandle(send_comm1);
	menu_handle = esos_GetTaskHandle(display_menu);
	rt_handle = esos_GetTaskHandle(display_rtlabels);
    
	ESOS_TASK_WAIT_TICKS(100);

	avr_buffer[0] = LCD_CLRSCR;
	avr_buffer[1] = 0;
	AVR_CALL();

	avr_buffer[0] = GOTO_CMD;
	avr_buffer[1] = 7;
	avr_buffer[2] = 0;
	avr_buffer[2] = (UCHAR)strlen(correct_password);
	AVR_CALL();
/*
	avr_buffer[0] = CHAR_CMD;
	avr_buffer[1] = 7;
	avr_buffer[2] = 0x3C;  // '<'
	AVR_CALL();
*/
	avr_buffer[0] = EEPROM_STR;
	avr_buffer[1] = 6;	// row 6
	avr_buffer[2] = 0;	// col 0
	avr_buffer[3] = VARIOUS_MSG_OFFSET;	//  ("enter password")
	avr_buffer[4] = 10;
	AVR_CALL();

	avr_buffer[0] = SET_MODE_CMD;
	avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
	avr_buffer[2] = 7;
	avr_buffer[3] = 0;
	avr_buffer[4] = (LINE_2_CURSOR);
	AVR_CALL();

	temp = 0;
	while (TRUE)
	{
		ESOS_TASK_WAIT_FOR_MAIL();

		while(ESOS_TASK_IVE_GOT_MAIL())
		{
			data1 = __esos_CB_ReadUINT8(__pstSelf->pst_Mailbox->pst_CBuffer);
			switch(data1)
			{
				case	KP_0:
				case 	KP_1:
				case	KP_2:
				case	KP_3:
				case	KP_4:
				case	KP_5:
				case	KP_6:
				case	KP_7:
				case	KP_8:
				case	KP_9:
					data1 = data1 - KP_1 + 0x31;
					password[password_ptr] = data1;
					avr_buffer[0] = CHAR_CMD;
					avr_buffer[1] = '*';
					AVR_CALL();
					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = 7;
					avr_buffer[3] = password_ptr+1;
					avr_buffer[4] = (LINE_1_CURSOR);
					AVR_CALL();
				break;

				case	KP_A:
/*
					i = 0;
					while(password[i] != 0 && correct_password[i] != 0 &&
													 password[i] == correct_password[i])
					{
						i++;
					}
					if(i > PASSWORD_SIZE)
						temp == 2;
					else if(password[i] == correct_password[i])
						temp = 3;
*/
					break;

				// backspace over current password
				case	KP_B:
					password_ptr--;
					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = 7;
					avr_buffer[3] = password_ptr;
					avr_buffer[4] = (LINE_1_CURSOR);
					AVR_CALL();
					break;

				case	KP_C:
				case	KP_D:
				case	KP_POUND:
				case	KP_AST:
				break;
				
				default:
				temp = 2;
				break;
			}

			// if password incorrect

			if(password[password_ptr] != correct_password[password_ptr])
			{

				// if incorrect password, first display "bad password" message
				avr_buffer[0] = LCD_CLRSCR;
				avr_buffer[1] = 0;
				AVR_CALL();

/*
				avr_buffer[0] = GOTO_CMD;
				avr_buffer[0] = 7;
				avr_buffer[0] = strlen(correct_password);
				AVR_CALL();

				avr_buffer[0] = CHAR_CMD;
				avr_buffer[0] = 7;
				avr_buffer[0] = '<';
				AVR_CALL();
*/
				avr_buffer[0] = EEPROM_STR;
				avr_buffer[1] = 5;
				avr_buffer[2] = 0;
				avr_buffer[3] = VARIOUS_MSG_OFFSET + 1;	// "bad password"
				avr_buffer[4] = 1;
				AVR_CALL();

				avr_buffer[0] = EEPROM_STR;
				avr_buffer[1] = 6;	// row 7
				avr_buffer[2] = 0;	// col 0
				avr_buffer[3] =  VARIOUS_MSG_OFFSET;	// ("enter password")
				avr_buffer[4] = 1;
				AVR_CALL();

				avr_buffer[0] = SET_MODE_CMD;
				avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
				avr_buffer[2] = 7;
				avr_buffer[3] = 0;
				avr_buffer[4] = (LINE_1_CURSOR);
				AVR_CALL();
				memset(password,0,PASSWORD_SIZE);
				password_ptr = -1;
				password_retries++;
			}else if(password_ptr == strlen(correct_password) - 1)
			{
				memset(password,0,PASSWORD_SIZE);
				password_ptr = -1;
				avr_buffer[0] = LCD_CLRSCR;
				avr_buffer[1] = 0;
				AVR_CALL();

				__esos_CB_WriteUINT8(menu_handle->pst_Mailbox->pst_CBuffer,data1);

				__esos_CB_WriteUINT8(rt_handle->pst_Mailbox->pst_CBuffer,data1);
				key_mode = NORMAL;
			}
			
//			}else if (password_ptr > strlen(correct_password) || )

			// for debugging - just start over
/*
			if(password_retries > 3)
			{
				password_valid = 1;
				avr_buffer[0] = LCD_CLRSCR;
				avr_buffer[1] = 0;
				AVR_CALL();

				avr_buffer[0] = EEPROM_STR;
				avr_buffer[1] = 6;	// row 6
				avr_buffer[2] = 0;	// col 0
				avr_buffer[3] = VARIOUS_MSG_OFFSET;	//  ("enter password")
				avr_buffer[4] = 10;
				AVR_CALL();

				avr_buffer[0] = SET_MODE_CMD;
				avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
				avr_buffer[2] = 7;
				avr_buffer[3] = 0;
				avr_buffer[4] = (LINE_1_CURSOR);
				AVR_CALL();
			}
*/
			password_ptr++;
			if(password_ptr > PASSWORD_SIZE)
				password_ptr = 0;

		}		// end of mail
	}	// end of 'while(TRUE)'
    ESOS_TASK_END();
}

//******************************************************************************************//
//************************************* numentry_task **************************************//
//******************************************************************************************//
ESOS_USER_TASK(numentry_task)
{
	static UCHAR data1;
	
    ESOS_TASK_BEGIN();

	while (TRUE)
	{
		ESOS_TASK_WAIT_FOR_MAIL();

		while(ESOS_TASK_IVE_GOT_MAIL())
		{
			data1 = __esos_CB_ReadUINT8(__pstSelf->pst_Mailbox->pst_CBuffer);

			switch(data1)
			{
				case 	KP_1:
				break;
				case	KP_2:
				break;
				case	KP_3:
				break;
				case	KP_4:
				break;
				case	KP_5:
				break;
				case	KP_6:
				break;
				case	KP_7:
				break;
				case	KP_8:
				break;
				case	KP_9:
				break;
				case	KP_A:
				break;
				case	KP_B:
				break;
				case	KP_C:
				break;
				case	KP_D:
				break;
				case	KP_POUND:
				break;
				case	KP_AST:
				break;
				case	KP_0:
				break;
				default:
				break;
			}
		}
	}
    ESOS_TASK_END();
}

/*
RE0 - p93 - 5th from right inside top			//	row 0
RE1 - p94 - 4th from right outside top			//	row 1
RE2 - p98 - 2nd from right outside top			//	row 2
RE3 - p99 - 2nd from right inside top			//	row 3

RA0 - p17 - 5th up - outside right				//	col 0
RA1 - p38 - 7th from right - outside bottom		//	col 1
RA2 - p58 - 4th up from bottom - inside left	//	col 2
RA3 - p59 - 5th up from bottom - outside left	//	col 3
*/

#define C0 _RA0
#define C1 _RA1
#define C2 _RA2
#define C3 _RA3

