EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
// test

static inline void CONFIG_COLUMN()
{
	CONFIG_RA0_AS_DIG_INPUT();
	ENABLE_RA0_PULLUP();
	CONFIG_RA1_AS_DIG_INPUT();
	ENABLE_RA1_PULLUP();
	CONFIG_RA2_AS_DIG_INPUT();
	ENABLE_RA2_PULLUP();
	CONFIG_RA3_AS_DIG_INPUT();
	ENABLE_RA3_PULLUP();
}

#define R0 _LATE0
#define R1 _LATE1
#define R2 _LATE2
#define R3 _LATE3

#define CONFIG_R0_DIG_OUTPUT() CONFIG_RE0_AS_DIG_OUTPUT()
#define CONFIG_R1_DIG_OUTPUT() CONFIG_RE1_AS_DIG_OUTPUT()
#define CONFIG_R2_DIG_OUTPUT() CONFIG_RE2_AS_DIG_OUTPUT()
#define CONFIG_R3_DIG_OUTPUT() CONFIG_RE3_AS_DIG_OUTPUT()

void CONFIG_ROW()
{
	CONFIG_R0_DIG_OUTPUT();
	CONFIG_R1_DIG_OUTPUT();
	CONFIG_R2_DIG_OUTPUT();
	CONFIG_R3_DIG_OUTPUT();
}

static inline void DRIVE_ROW_LOW()
{
	R0 = 0;
	R1 = 0;
	R2 = 0;
	R3 = 0;
}

static inline void DRIVE_ROW_HIGH()
{
	R0 = 1;
	R1 = 1;
	R2 = 1;
	R3 = 1;
}

typedef enum
{
	STATE_WAIT_FOR_PRESS = 0x30,
	STATE_WAIT_FOR_PRESS2,
	STATE_WAIT_FOR_RELEASE
} ISRSTATE;

static ISRSTATE e_isrState;
static uint8_t u8_newKey = 0;

void configKeypad(void)
{
	CONFIG_ROW();
	DRIVE_ROW_LOW();
	CONFIG_COLUMN();
	DELAY_US(1);								  //wait for pullups to stabilize inputs
	e_isrState = STATE_WAIT_FOR_PRESS;
}

//drive one row low
void setOneRowLow(uint8_t u8_x)
{
	switch (u8_x)
	{
		case 0:
			R0 = 0;
			R1 = 1;
			R2 = 1;
			R3 = 1;
			break;
		case 1:
			R0 = 1;
			R1 = 0;
			R2 = 1;
			R3 = 1;
			break;
		case 2:
			R0 = 1;
			R1 = 1;
			R2 = 0;
			R3 = 1;
			break;
		default:
			R0 = 1;
			R1 = 1;
			R2 = 1;
			R3 = 0;
			break;
	}
}
#define NUM_ROWS 4
#define NUM_COLS 4
const uint8_t au8_keyTable[NUM_ROWS][NUM_COLS] =
{
	{KP_1, KP_2, KP_3, KP_A },
	{KP_4, KP_5, KP_6, KP_B },
	{KP_7, KP_8, KP_9, KP_C },
	{KP_AST, KP_0, KP_POUND, KP_D}
};
//	{'1', '2', '3', 'A'},
//	{'4', '5', '6', 'B'},
//	{'7', '8', '9', 'C'},
//	{'*', '0', '#', 'D'}

#define KEY_PRESSED() (!C0 || !C1 || !C2 || !C3)  //any low
#define KEY_RELEASED() (C0 && C1 && C2 && C3)	  //all high

uint8_t doKeyScan(void)
{
	uint8_t u8_row, u8_col;
//determine column
	if (!C0) u8_col = 0;
	else if (!C1) u8_col = 1;
	else if (!C2) u8_col = 2;
	else if (!C3) u8_col = 3;
	else return('E');							  //error
//determine row
	for (u8_row = 0; u8_row < NUM_ROWS; u8_row++)
	{
		setOneRowLow(u8_row);					  //enable one row low
		if (KEY_PRESSED())
		{
			DRIVE_ROW_LOW();					  //return rows to driving low
			return(au8_keyTable[u8_row][u8_col]);
		}
	}
	DRIVE_ROW_LOW();							  //return rows to driving low
	return('E');								  //error
}
#endif
//******************************************************************************************//
//*************************************** keypad *******************************************//
//******************************************************************************************//
// DTMF tones are: 1->9, A->D, #, *, 0 (0->15)
ESOS_USER_TASK(keypad)
{
	static UINT data1;
	static UCHAR data2;

    ESOS_TASK_BEGIN();

    data2 = 0;
    data1 = 0;
   	silent_key = 1;

	while(TRUE)
	{
		ESOS_TASK_WAIT_TICKS(2);
		switch (e_isrState)
		{
			case STATE_WAIT_FOR_PRESS:
				if (KEY_PRESSED() && (u8_newKey == 0))
				{
	//ensure that key is sampled low for two consecutive interrupt periods
					e_isrState = STATE_WAIT_FOR_PRESS2;
				}
				break;
			case STATE_WAIT_FOR_PRESS2:
				if (KEY_PRESSED())
				{
	// a key is ready
					u8_newKey = doKeyScan();
					e_isrState = STATE_WAIT_FOR_RELEASE;
// send the message to FPGA to turn on DTMF tone
					if(silent_key == 0)
					{
						data1 = DTMF_TONE_ON;
						data1 <<= 8;
						data1 &= 0xFF00;

						data1 |= u8_newKey - 0xE0;

						__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data1);
					}


				} else e_isrState = STATE_WAIT_FOR_PRESS;
				break;

			case STATE_WAIT_FOR_RELEASE:
	//keypad released
				if (KEY_RELEASED())
				{
					ESOS_SIGNAL_SEMAPHORE(key_sem,1);
					e_isrState = STATE_WAIT_FOR_PRESS;
// send the message to FPGA to turn on DTMF tone

					if(silent_key == 0)
					{
						data1 = DTMF_TONE_OFF;
						data1 <<= 8;
						data1 &= 0xFF00;

						__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data1);
					}

				}
				break;
			default:
				e_isrState = STATE_WAIT_FOR_PRESS;
				break;
		}
	}
	ESOS_TASK_END();
}

//******************************************************************************************//
//************************************ key_timer_task **************************************//
//******************************************************************************************//
// dim the display after so many seconds of not getting a keypress
ESOS_USER_TASK(key_timer_task)
{
	static UINT data3;
	static UCHAR prev_seconds_high;
	static UCHAR prev_seconds_low;

    ESOS_TASK_BEGIN();

    key_enter_time = 0;
	dim_screen = 0;
	
	prev_seconds_high = prev_seconds_low = 0;
	while (TRUE)
	{
		ESOS_TASK_WAIT_TICKS(1000);

/*
		avr_buffer[0] = SEND_INT_RT_VALUES;
		avr_buffer[1] = rtlabel_str[RPM].row;
		avr_buffer[2] = rtlabel_str[RPM].data_col;
		avr_buffer[3] = (UCHAR)(rpm >> 8);
		avr_buffer[4] = (UCHAR)rpm;
		AVR_CALL();

		avr_buffer[0] = SEND_INT_RT_VALUES;
		avr_buffer[1] = rtlabel_str[RPM].row;
		avr_buffer[2] = rtlabel_str[RPM].data_col;
		avr_buffer[3] = (UCHAR)(mph >> 8);
		avr_buffer[4] = (UCHAR)mph;
		AVR_CALL();


		if(seconds_display_high != prev_seconds_high)
		{
			prev_seconds_high = seconds_display_high;
		}
		if(seconds_display_low != prev_seconds_low)
		{
			prev_seconds_low = seconds_display_low;
		}
		if(++prev_seconds_low > 9)
			prev_seconds_low = 0;

		avr_buffer[0] = GOTO_CMD;
		avr_buffer[1] = 0;
		avr_buffer[2] = 39;		

		avr_buffer[0] = CHAR_CMD;
		avr_buffer[1] = prev_seconds_low;
		AVR_CALL();
*/		
		if(key_enter_time == 30)
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_80DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		if(key_enter_time == 45)
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_75DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		if(key_enter_time == 60)
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_50DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		if(key_enter_time == 90)
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_25DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		if(key_enter_time == 120)
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_12DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		if(key_enter_time == 240)
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_OFF_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		key_enter_time++;
	}
    ESOS_TASK_END();
}
//******************************************************************************************//
//************************************** poll_keypad ***************************************//
//******************************************************************************************//
ESOS_USER_TASK(poll_keypad)
{

