EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
	CONFIG_RB10_AS_ANALOG();	// extra
	CONFIG_RB11_AS_ANALOG();	// extra

	CONFIG_RB12_AS_ANALOG();	// extra
//	CONFIG_RB13_AS_ANALOG();

//	CONFIG_RB14_AS_ANALOG();
//	CONFIG_RB15_AS_ANALOG();

//	configADC1_AutoScanIrqCH0( ADC_SCAN_AN0 | ADC_SCAN_AN1 | ADC_SCAN_AN2 |
//			 ADC_SCAN_AN3 | ADC_SCAN_AN4 | ADC_SCAN_AN5, 31, 0);

//	configADC1_AutoScanIrqCH0( 0xFFFF, 31, 0);
	/// can't do 6 & 7 unless program to chip and use jumpers
	// because 6 & 7 are shared by Pickit programmer!
	configADC1_AutoScanIrqCH0( 0x1F3F, 31, 0);
//	configADC1_AutoHalfScanIrqCH0(0x00FF, 31, 0);
	while (!AD1CON1bits.DONE)
		ESOS_TASK_WAIT_TICKS(1);

//	ESOS_TASK_SLEEP();

	while (TRUE)
	{
		if(key_mode == NORMAL)
		{
			while (u8_waiting)	// wait for valid data in ISR
				ESOS_TASK_WAIT_TICKS(1);

			u8_waiting = 0;
			for (i = 0;i<NUM_ADC_CHANNELS;i++)
			{
				fres = (float)au16_buffer[i];
				fres *= 107.0;
				fres /= 1023.0;
				u8_pot[i] = (UCHAR)fres;

			// this sends the ADC data to the TS-7200
			__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,RT_DATA);
		}
		ESOS_TASK_WAIT_TICKS(500);
	}
	ESOS_TASK_END();
}
//******************************************************************************************//
//************************************ ACD1Interrupt  **************************************//
//******************************************************************************************//
void _ISR _ADC1Interrupt (void)
{
	uint8_t			u8_i;
	uint16_t*		au16_adcHWBuff = (uint16_t*) &ADC1BUF0;

	for ( u8_i=0; u8_i<NUM_ADC_CHANNELS; u8_i++)
	{
		au16_buffer[u8_i] = au16_adcHWBuff[u8_i];
	} //end for()
	u8_waiting = 0;  // signal main() that data is ready
	_AD1IF = 0;   //clear the interrupt flag
}
